#####   Name: RISHAV KUMAR
#####   Roll no. 2301560042
This file was created by me and i used it to prefom different methods of pandas libraries.

In [5]:
import pandas as pd

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'Age': [25, 30, 22, 35, 28],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Boston'],
    'Salary': [60000, 80000, 55000, 75000, 70000]
}

In [7]:

df = pd.DataFrame(data)

In [12]:
selected_data = df.loc[df['Age'] > 25, ['Name', 'City']]
selected_data

    Name           City
1    Bob  San Francisco
3  David        Chicago
4  Emily         Boston

In [13]:

filtered_data = df[df['City'].isin(['New York', 'Chicago'])]
filtered_data

    Name  Age      City  Salary
0  Alice   25  New York   60000
3  David   35   Chicago   75000

In [14]:
missing_values = df.isnull()
missing_values

    Name    Age   City  Salary
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False

In [15]:
selected_rows = df.iloc[1:4, 0:2]
selected_rows

      Name  Age
1      Bob   30
2  Charlie   22
3    David   35